00441650: sub      sp, sp, #0x1c0
00441654: stp      x29, x30, [sp, #0x170]
00441658: stp      x28, x25, [sp, #0x180]
0044165c: stp      x24, x23, [sp, #0x190]
00441660: stp      x22, x21, [sp, #0x1a0]
00441664: stp      x20, x19, [sp, #0x1b0]
00441668: add      x29, sp, #0x170
0044166c: fmov     d0, xzr
00441670: movi     v1.2d, #0xffffffffffffffff
00441674: mrs      x25, tpidr_el0
00441678: ldr      x8, [x25, #0x28]
0044167c: adrp     x1, #0x2a000
00441680: add      x1, x1, #0x94d
00441684: mov      x19, x0
00441688: mov      v0.d[1], v0.d[0]
0044168c: stur     x8, [x29, #-8]
00441690: str      d1, [x0, #0x10]
00441694: str      q0, [x0]
00441698: bl       #0x441c84
0044169c: cbz      x0, #0x4417c4
004416a0: adrp     x1, #0x28000
004416a4: add      x1, x1, #0x6ee
004416a8: mov      x20, x0
004416ac: bl       #0x554220 ; strstr
004416b0: mov      x21, x0
004416b4: adrp     x1, #0x24000
004416b8: add      x1, x1, #0xa1
004416bc: mov      x0, x20
004416c0: bl       #0x554220 ; strstr
004416c4: cbz      x21, #0x4417e0
004416c8: mov      x22, x0
004416cc: cbz      x0, #0x4417e0
004416d0: add      x23, x21, #6
004416d4: mov      w1, #0x2f
004416d8: mov      x0, x23
004416dc: bl       #0x554620 ; strchr
004416e0: add      x21, x22, #9
004416e4: mov      x24, x0
004416e8: adrp     x1, #0x27000
004416ec: add      x1, x1, #0x390
004416f0: mov      x0, x21
004416f4: bl       #0x554220 ; strstr
004416f8: subs     x2, x24, x23
004416fc: b.ls     #0x441804
00441700: subs     x22, x0, x21
00441704: b.ls     #0x441804
00441708: movi     v0.2d, #0000000000000000
0044170c: cmp      x2, #0x1f
00441710: stp      q0, q0, [x29, #-0x30]
00441714: b.hi     #0x441828
00441718: cmp      x22, #0x40
0044171c: b.hs     #0x441828
00441720: sub      x0, x29, #0x30
00441724: mov      x1, x23
00441728: mov      w3, #0x20
0044172c: bl       #0x554630 ; __memcpy_chk
00441730: movi     v0.2d, #0000000000000000
00441734: adrp     x3, #0x28000
00441738: add      x3, x3, #0xbaf
0044173c: sub      x0, x29, #0x90
00441740: mov      w1, #0x60
00441744: mov      w2, #0x60
00441748: mov      w4, w22
0044174c: mov      x5, x21
00441750: stp      q0, q0, [x29, #-0x90]
00441754: stp      q0, q0, [x29, #-0x70]
00441758: stp      q0, q0, [x29, #-0x50]
0044175c: bl       #0x41dd88
00441760: mov      x0, x20
00441764: bl       #0x554230 ; free
00441768: movi     v0.2d, #0000000000000000
0044176c: adrp     x3, #0x29000
00441770: add      x3, x3, #0x848
00441774: add      x0, sp, #0x80
00441778: sub      x4, x29, #0x30
0044177c: mov      w1, #0x60
00441780: mov      w2, #0x60
00441784: stp      q0, q0, [sp, #0x80]
00441788: stp      q0, q0, [sp, #0xa0]
0044178c: stp      q0, q0, [sp, #0xc0]
00441790: bl       #0x41dd88
00441794: movi     v0.2d, #0000000000000000
00441798: add      x0, sp, #0x80
0044179c: mov      x1, sp
004417a0: stp      q0, q0, [sp]
004417a4: stp      q0, q0, [sp, #0x20]
004417a8: stp      q0, q0, [sp, #0x40]
004417ac: stp      q0, q0, [sp, #0x60]
004417b0: bl       #0x553f30 ; stat
004417b4: cbz      w0, #0x441864
004417b8: adrp     x0, #0x26000
004417bc: add      x0, x0, #0xe44 ; 'QX驱动FD信息读取失败'
004417c0: b        #0x4418cc
004417c4: ldr      x8, [x25, #0x28]
004417c8: ldur     x9, [x29, #-8]
004417cc: cmp      x8, x9
004417d0: b.ne     #0x4418fc
004417d4: adrp     x0, #0x25000
004417d8: add      x0, x0, #0xa1c ; 'QX驱动探测失败'
004417dc: b        #0x441848
004417e0: mov      x0, x20
004417e4: bl       #0x554230 ; free
004417e8: ldr      x8, [x25, #0x28]
004417ec: ldur     x9, [x29, #-8]
004417f0: cmp      x8, x9
004417f4: b.ne     #0x4418fc
004417f8: adrp     x0, #0x21000
004417fc: add      x0, x0, #0x734 ; 'QX驱动探测结果无效'
00441800: b        #0x441848
00441804: mov      x0, x20
00441808: bl       #0x554230 ; free
0044180c: ldr      x8, [x25, #0x28]
00441810: ldur     x9, [x29, #-8]
00441814: cmp      x8, x9
00441818: b.ne     #0x4418fc
0044181c: adrp     x0, #0x2b000
00441820: add      x0, x0, #0xdd8 ; 'QX驱动探测字段无效'
00441824: b        #0x441848
00441828: mov      x0, x20
0044182c: bl       #0x554230 ; free
00441830: ldr      x8, [x25, #0x28]
00441834: ldur     x9, [x29, #-8]
00441838: cmp      x8, x9
0044183c: b.ne     #0x4418fc
00441840: adrp     x0, #0x27000
00441844: add      x0, x0, #0x3ac ; 'QX驱动探测字段超长'
00441848: ldp      x20, x19, [sp, #0x1b0]
0044184c: ldp      x22, x21, [sp, #0x1a0]
00441850: ldp      x24, x23, [sp, #0x190]
00441854: ldp      x28, x25, [sp, #0x180]
00441858: ldp      x29, x30, [sp, #0x170]
0044185c: add      sp, sp, #0x1c0
00441860: b        #0x553f60 ; puts
00441864: sub      x0, x29, #0x90
00441868: mov      w1, wzr
0044186c: bl       #0x554520 ; access
00441870: cbz      w0, #0x441894
00441874: ldr      x2, [sp, #0x20]
00441878: sub      x0, x29, #0x90
0044187c: mov      w1, #0x2180
00441880: bl       #0x554af0 ; mknod
00441884: cbz      w0, #0x441894
00441888: adrp     x0, #0x2b000
0044188c: add      x0, x0, #0x40c ; 'QX驱动节点创建失败'
00441890: b        #0x4418cc
00441894: mov      w1, #2
00441898: sub      x0, x29, #0x90
0044189c: movk     w1, #8, lsl #16
004418a0: bl       #0x554130 ; __open_2
004418a4: str      w0, [x19, #0x10]
004418a8: sub      x0, x29, #0x90
004418ac: bl       #0x554aa0 ; unlink
004418b0: ldr      w8, [x19, #0x10]
004418b4: adrp     x9, #0x2b000
004418b8: add      x9, x9, #0x427 ; 'QX驱动连接成功'
004418bc: cmp      w8, #0
004418c0: adrp     x8, #0x21000
004418c4: add      x8, x8, #0x21f ; 'QX驱动连接失败'
004418c8: csel     x0, x8, x9, lt
004418cc: bl       #0x553f60 ; puts
004418d0: ldr      x8, [x25, #0x28]
004418d4: ldur     x9, [x29, #-8]
004418d8: cmp      x8, x9
004418dc: b.ne     #0x4418fc
004418e0: ldp      x20, x19, [sp, #0x1b0]
004418e4: ldp      x22, x21, [sp, #0x1a0]
004418e8: ldp      x24, x23, [sp, #0x190]
004418ec: ldp      x28, x25, [sp, #0x180]
004418f0: ldp      x29, x30, [sp, #0x170]
004418f4: add      sp, sp, #0x1c0
004418f8: ret      
004418fc: bl       #0x553f00 ; __stack_chk_fail
